[
  {
    "id": "1",
    "courseId": "01",
    "courseName": "Data Structure",
    "price": "559",
    "img": "https://w10.naukri.com/mailers/2022/naukri-learning/what-is/What-is-Data-Structures-and-Algorithms.jpg",
    "description": "A data structure is a specialized format for organizing, processing, retrieving and storing data.",
    "details": [
      "In computer science, a data structure is a data organization, management, and storage format that is usually chosen for efficient access to data.",
      "More precisely, a data structure is a collection of data values.",
      "The relationships among them.",
      "And the functions or operations that can be applied to the data",
      "Example:  it is an algebraic structure about data."
    ]
  },
  {
    "id": "2",
    "courseId": "02",
    "courseName": "Algorithm",
    "price": "120",
    "description": "In mathematics and computer science, an algorithm is a finite sequence of rigorous instructions, typically used to solve a class of specific problems.",
    "img": "https://www.investopedia.com/thmb/s56ubR5UguDpmw4xitrCznhYbp4=/735x0/algorithm-8507b849b8ee48e5887fda56916dd037.png",
    "details": [
      "An algorithm is a set of instructions for solving a problem or accomplishing a task.",
      "Every computerized device uses algorithms, which cut the time required to do things manually.",
      "The relationships among them.",
      "Algorithmic trading, also known as automated trading or black-box trading, uses a computer program to buy or sell securities at a pace not possible for humans.",
      "Algorithmic trading accounts for over 60% of all trading volume in the global equities markets.",
      "Algorithmic traders can analyze information faster than humans, allowing them to respond instantly to minute price movements."
    ]
  },
  {
    "id": "3",
    "courseId": "03",
    "price": "220",
    "courseName": "Object Oriented Programming",
    "description": "Object-oriented programming is a programming paradigm based on the concept of objects, which can contain data and code.",
    "img": "https://miro.medium.com/max/600/0*7zMicw-FfThCbN35.png",
    "details": [
      "The four pillars of object oriented programming are:.",
      "Inheritance: child classes inherit data and behaviors from parent class.",
      "Encapsulation: containing information in an object, exposing only selected information",
      "Abstraction: only exposing high level public methods for accessing an object",
      "Polymorphism: many methods can do the same task"
    ]
  },
  {
    "id": "4",
    "courseId": "04",
    "price": "820",
    "courseName": "Artificial Intelligence",
    "description": "In the simplest terms, AI which stands for artificial intelligence refers to systems or machines that mimic human intelligence to perform tasks and can iteratively improve themselves based on the information they collect.",
    "img": "https://www.codingdojo.com/blog/wp-content/uploads/ai-v2-img3.jpg",
    "details": [
      "Artificial intelligence (AI) refers to the simulation or approximation of human intelligence in machines.",
      "The goals of artificial intelligence include computer-enhanced learning, reasoning, and perception.",
      "AI is being used today across different industries from finance to healthcare.",
      "Weak AI tends to be simple and single-task oriented, while strong AI carries on tasks that are more complex and human-like.",
      "Some critics fear that the extensive use of advanced AI can have a negative effect on society."
    ]
  },
  {
    "id": "5",
    "courseId": "05",
    "price": "320",
    "courseName": "Mobile App Development",
    "img": "https://w10.naukri.com/mailers/2022/naukri-learning/what-is/What-is-Data-Structures-and-Algorithms.jpg",
    "description": "A data structure is a specialized format for organizing, processing, retrieving and storing data.",
    "details": [
      "In computer science, a data structure is a data organization, management, and storage format that is usually chosen for efficient access to data.",
      "More precisely, a data structure is a collection of data values.",
      "The relationships among them.",
      "nd the functions or operations that can be applied to the data",
      "example:  it is an algebraic structure about data."
    ]
  },
  {
    "id": "6",
    "courseId": "06",
    "price": "220",
    "courseName": "Neural Network and Fuzzy Systems",
    "img": "https://w10.naukri.com/mailers/2022/naukri-learning/what-is/What-is-Data-Structures-and-Algorithms.jpg",
    "description": "A data structure is a specialized format for organizing, processing, retrieving and storing data.",
    "details": [
      "In computer science, a data structure is a data organization, management, and storage format that is usually chosen for efficient access to data.",
      "More precisely, a data structure is a collection of data values.",
      "The relationships among them.",
      "nd the functions or operations that can be applied to the data",
      "example:  it is an algebraic structure about data."
    ]
  }
  
]